# –í–≤–µ–¥–µ–Ω–∏–µ –≤ SQL

https://www.severcart.ru/blog/all/python_sqlite3/

## 1. –†–µ–ª—è—Ü–∏–æ–Ω–Ω—ã–µ vs –Ω–µ—Ä–µ–ª—è—Ü–∏–æ–Ω–Ω—ã–µ –ë–î

üìå **–†–µ–ª—è—Ü–∏–æ–Ω–Ω–∞—è –±–∞–∑–∞ –¥–∞–Ω–Ω—ã—Ö** ‚Äî —ç—Ç–æ –Ω–∞–±–æ—Ä –¥–∞–Ω–Ω—ã—Ö —Å –ø—Ä–æ–¥–æ–ø—Ä–µ–¥–µ–ª–µ–Ω–Ω—ã–º–∏ —Å–≤—è–∑–ª–∏–∏ –º–µ–∂–¥—É –Ω–∏–º–∏. –≠—Ç–∏ –¥–∞–Ω–Ω—ã–µ –æ—Ä–≥–∞–Ω–∏–∑–æ–≤–∞–Ω—ã –≤ –≤–∏–¥–µ –Ω–∞–±–æ—Ä–∞ —Ç–∞–±–ª–∏—Ü, —Å–æ—Å—Ç–æ—è—â–∏—Ö –∏–∑ —Å—Ç–æ–ª–±—Ü–æ–≤ –∏ —Å—Ç—Ä–æ–∫.

üìå **–†–µ–ª—è—Ü–∏–æ–Ω–Ω—ã–µ –ë–î** —Ö—Ä–∞–Ω—è—Ç —Å—Ç—Ä—É–∫—Ç—É—Ä–∏—Ä–æ–≤–∞–Ω–Ω—ã–µ –¥–∞–Ω–Ω—ã–µ, –∫–æ—Ç–æ—Ä—ã–µ –æ–±—ã—á–Ω–æ –ø—Ä–µ–¥—Å—Ç–∞–≤–ª—è—é—Ç –æ–±—ä–µ–∫—Ç—ã —Ä–µ–∞–ª—å–Ω–æ–≥–æ –º–∏—Ä–∞. –°–∫–∞–∂–µ–º, —ç—Ç–æ –º–æ–≥—É—Ç –±—ã—Ç—å —Å–≤–µ–¥–µ–Ω–∏—è –æ —á–µ–ª–æ–≤–µ–∫–µ, –∏–ª–∏ –æ —Å–æ–¥–µ—Ä–∂–∏–º–æ–º –∫–æ—Ä–∑–∏–Ω—ã –¥–ª—è —Ç–æ–≤–∞—Ä–æ–≤ –≤ –º–∞–≥–∞–∑–∏–Ω–µ, —Å–≥—Ä—É–ø–ø–∏—Ä–æ–≤–∞–Ω–Ω—ã–µ –≤ —Ç–∞–±–ª–∏—Ü–∞—Ö, —Ñ–æ—Ä–º–∞—Ç –∫–æ—Ç–æ—Ä—ã—Ö –∑–∞–¥–∞–Ω –Ω–∞ —ç—Ç–∞–ø–µ –ø—Ä–æ–µ–∫—Ç–∏—Ä–æ–≤–∞–Ω–∏—è —Ö—Ä–∞–Ω–∏–ª–∏—â–∞.

–ù—É–∂–Ω—ã –¥–ª—è –∑–∞–∫–ª—é—á–µ–Ω–∏—è –≤ –Ω–µ–∫—É—é —Å—Ç—Ä—É–∫—Ç—É—Ä—É —Ñ–∏–∫—Å–∏—Ä–æ–≤–∞–Ω–Ω—ã—Ö —Å–º—ã—Å–ª–æ–≤—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π

üìå **–ù–µ—Ä–µ–ª—è—Ü–∏–æ–Ω–Ω—ã–µ –ë–î** –ø—Ä–µ–¥–ª–∞–≥–∞—é—Ç –¥–∏–Ω–∞–º–∏—á–µ—Å–∫—É—é —Å—Ç—Ä—É–∫—Ç—É—Ä—É –¥–∞–Ω–Ω—ã—Ö, –∫–æ—Ç–æ—Ä—ã—é –º–æ–≥—É—Ç —Ö—Ä–∞–Ω–∏—Ç—å—Å—è –Ω–µ—Å–∫–æ–ª—å–∫–∏–º–∏ —Å–ø–æ—Å–æ–±–∞–º–∏: –æ—Ä–∏–µ–Ω—Ç–∏—Ä–æ–≤–∞–Ω–Ω–æ –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º, –¥–æ–∫—É–º–µ–Ω—Ç–æ-–æ—Ä–∏–µ–Ω—Ç–∏—Ä–æ–≤–∞–Ω–Ω–æ, –≤ –≤–∏–¥–µ –≥—Ä–∞—Ñ–æ–≤ –∏–ª–∏ –Ω–∞ –æ—Å–Ω–æ–≤–µ –ø–∞—Ä ¬´–∫–ª—é—á - –∑–Ω–∞—á–µ–Ω–∏–µ¬ª.

–°—Ç—Ä—É–∫—Ç—É—Ä–∞ –∑–∞—Ä–∞–Ω–µ–µ –Ω–µ –æ–ø—Ä–µ–¥–µ–ª–µ–Ω–∞

–ü—Ä–∏–º–µ—Ä: –ø–æ—Ç–æ–∫ –ª–æ–≥–æ–≤, –∫–ª–∏–∫—Å—Ç—Ä–∏–º—ã

![–ù–µ—Ä–µ–ª—è—Ü–∏–æ–Ω–Ω–∞—è](img/–Ω–µ—Ä–µ–ª—è—Ü–∏–æ–Ω–Ω–∞—è_–±–¥.png)

## 2. –Ø–∑—ã–∫ SQL

üìå **SQL** (–∞–Ω–≥–ª. structured query language ‚Äî ¬´—è–∑—ã–∫ —Å—Ç—Ä—É–∫—Ç—É—Ä–∏—Ä–æ–≤–∞–Ω–Ω—ã—Ö –∑–∞–ø—Ä–æ—Å–æ–≤¬ª) ‚Äî –¥–µ–∫–ª–∞—Ä–∞—Ç–∏–≤–Ω—ã–π —è–∑—ã–∫ –ø—Ä–æ–≥—Ä–∞–º–º–∏—Ä–æ–≤–∞–Ω–∏—è, –ø—Ä–∏–º–µ–Ω—è–µ–º—ã–π –¥–ª—è —Å–æ–∑–¥–∞–Ω–∏—è, –º–æ–¥–∏—Ñ–∏–∫–∞—Ü–∏–∏ –∏ —É–ø—Ä–∞–≤–ª–µ–Ω–∏—è –¥–∞–Ω–Ω—ã–º–∏ –≤ —Ä–µ–ª—è—Ü–∏–æ–Ω–Ω–æ–π –±–∞–∑–µ –¥–∞–Ω–Ω—ã—Ö.

üìå **SQL** –∏—Å–ø–æ–ª—å–∑—É–µ—Ç—Å—è –¥–ª—è –¥–æ–±–∞–≤–ª–µ–Ω–∏—è, –æ–±–Ω–æ–≤–ª–µ–Ω–∏—è –∏ —É–ø—Ä–∞–≤–ª–µ–Ω–∏—è —Å—Ç—Ä–æ–∫ –¥–∞–Ω–Ω—ã—Ö, –∏–∑–≤–ª–µ—á–µ–Ω–∏—è –Ω–∞–±–æ—Ä–∞ –¥–∞–Ω–Ω—ã—Ö –¥–ª—è –æ–±—Ä–∞–±–æ—Ç–∫–∏ —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–π –∏ –∞–Ω–∞–ª–∏—Ç–∏—á–µ—Å–∫–∏–π –ø—Ä–∏–ª–æ–∂–µ–Ω–∏–π, –∞ —Ç–∞–∫–∂–µ –¥–ª—è —É–ø—Ä–∞–≤–ª–µ–Ω–∏—è –≤—Å–µ–º–∏ –∞—Å–ø–µ–∫—Ç–∞–º–∏ —Ä–∞–±–æ—Ç—ã –±–∞–∑—ã –¥–∞–Ω–Ω—ã—Ö.

**–¢—Ä–∞–Ω–∑–∞ÃÅ–∫—Ü–∏—è** (–∞–Ω–≥–ª. transaction, –æ—Ç –ª–∞—Ç. transactio ‚Äî —Å–æ–≥–ª–∞—à–µ–Ω–∏–µ, –¥–æ–≥–æ–≤–æ—Ä) ‚Äî –º–∏–Ω–∏–º–∞–ª—å–Ω–∞—è –ª–æ–≥–∏—á–µ—Å–∫–∏ –æ—Å–º—ã—Å–ª–µ–Ω–Ω–∞—è –æ–ø–µ—Ä–∞—Ü–∏—è, –∫–æ—Ç–æ—Ä–∞—è –∏–º–µ–µ—Ç —Å–º—ã—Å–ª –∏ –º–æ–∂–µ—Ç –±—ã—Ç—å —Å–æ–≤–µ—Ä—à–µ–Ω–∞ —Ç–æ–ª—å–∫–æ –ø–æ–ª–Ω–æ—Å—Ç—å—é.

In [1]:
import sqlite3
import pandas as pd

üìå **–°–£–ë–î SQLite** –Ω–µ –æ–±—Ä–∞—â–∞–µ—Ç –≤–Ω–∏–º–∞–Ω–∏—è –Ω–∞ —Ç–∏–ø—ã –¥–∞–Ω–Ω—ã—Ö (–æ–Ω–∞ —Ö—Ä–∞–Ω–∏—Ç –≤—Å–µ –¥–∞–Ω–Ω—ã–µ –≤ –≤–∏–¥–µ —Å—Ç—Ä–æ–∫).

–°—Ö–µ–º–∞ —Ä–∞–±–æ—Ç—ã —Å –ë–î:

+ –ü–æ–¥–∫–ª—é—á–µ–Ω–∏–µ –∫ –±–∞–∑–µ –¥–∞–Ω–Ω—ã—Ö (–≤—ã–∑–æ–≤ `connect()` —Å –ø–æ–ª—É—á–µ–Ω–∏–µ–º –æ–±—ä–µ–∫—Ç–∞-—Å–æ–µ–¥–∏–Ω–µ–Ω–∏—è);
+ –°–æ–∑–¥–∞–Ω–∏–µ –æ–¥–Ω–æ–≥–æ –∏–ª–∏ –Ω–µ—Å–∫–æ–ª—å–∫–∏—Ö –∫—É—Ä—Å–æ—Ä–æ–≤ (–≤—ã–∑–æ–≤ –º–µ—Ç–æ–¥–∞ –æ–±—ä–µ–∫—Ç–∞-—Å–æ–µ–¥–∏–Ω–µ–Ω–∏—è `cursor()` - CURrent Set Of Records, —Ç–µ–∫—É—â–∏–π –Ω–∞–±–æ—Ä –∑–∞–ø–∏—Å–µ–π);
+ –ò—Å–ø–æ–ª–Ω–µ–Ω–∏–µ –∫–æ–º–∞–Ω–¥—ã –∏–ª–∏ –∑–∞–ø—Ä–æ—Å–∞ (–≤—ã–∑–æ–≤ –º–µ—Ç–æ–¥–∞ `execute()` –∏–ª–∏ –µ–≥–æ –≤–∞—Ä–∏–∞–Ω—Ç–æ–≤);
+ –ü–æ–ª—É—á–µ–Ω–∏–µ —Ä–µ–∑—É–ª—å—Ç–∞—Ç–æ–≤ –∑–∞–ø—Ä–æ—Å–∞ (–≤—ã–∑–æ–≤ –º–µ—Ç–æ–¥–∞ `fetchone()` –∏–ª–∏ –µ–≥–æ –≤–∞—Ä–∏–∞–Ω—Ç–æ–≤);
+ –ó–∞–≤–µ—Ä—à–µ–Ω–∏–µ —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–∏ –∏–ª–∏ –µ–µ –æ—Ç–∫–∞—Ç (–≤—ã–∑–æ–≤ –º–µ—Ç–æ–¥–∞ –æ–±—å–µ–∫—Ç–∞-—Å–æ–µ–¥–∏–Ω–µ–Ω–∏—è `commit()` –∏–ª–∏ `rollback()`);
+ –ö–æ–≥–¥–∞ –≤—Å–µ –Ω–µ–æ–±—Ö–æ–¥–∏–º—ã–µ —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–∏ –ø—Ä–æ–∏–∑–≤–µ–¥–µ–Ω—ã, –ø–æ–¥–∫–ª—é—á–µ–Ω–∏–µ –∑–∞–∫—Ä—ã–≤–∞–µ—Ç—Å—è –≤—ã–∑–æ–≤–æ–º –º–æ—Ç–æ–¥–∞ `close()` –æ–±—ä–µ–∫—Ç–∞-—Å–æ–µ–¥–∏–Ω–æ–Ω–∏—è.

In [3]:
connection = sqlite3.connect("Data/company.db")

cursor = connection.cursor()

# delete
cursor.execute("""DROP TABLE employee;""")

sq1_command = """
CREATE TABLE employee

(
    staff_number INTEGER PRIMARY KEY,
    fname VARCHAR(20),
    lname VARCHAR(30) DEFAUlT 'Ivanov',
    gender CHAR(1),
    joining DATE,
    birth_date DATE

);"""

cursor.execute(sq1_command)

sql_command = """INSERT INTO employee (staff_number, fname, lname, gender, birth_date)
                 VALUES (1324, "William", "Shakespeare", "m", "1961-10‚Äî25");"""
cursor.execute(sql_command)

sql_conmand = """UPDATE employee SET fname = 'Ivan' WHERE gender = 'm' """
cursor.execute(sql_conmand)

sql_conmand = """DELETE FROM employee WHERE lname = 'Petrov' """
cursor.execute(sql_conmand)

connection.commit()

connection.close()

In [4]:
connection = sqlite3.connect("Data/company.db")

cursor = connection.cursor()

staff_data = [ ("Willian", "Shakespeare", "m", "1961-10-25"),
               ("Frank", "Schiller", "m", "1955-08-17"),
               ("Jane", "Wall", "f", "1989-03-14") ]

for p in staff_data:
    format_str = """INSERT INTO employee (staff_number, fname, lname, gender, birth_date)
                    VALUES (NULL, "{first}", "{last}", "{gender}", "{birth_date}");"""

    sql_command = format_str.format(first=p[0], last=p[1], gender=p[2], birth_date = p[3])
    cursor.execute(sql_command)

connection.commit()

connection.close()

## 3. –û—Å–Ω–æ–≤–Ω—ã–µ –∫–æ–º–∞–Ω–¥—ã

### 3.1. CREATE TABLE

–°–æ–∑–¥–∞–Ω–∏–µ –±–∞–∑–æ–≤–æ–π —Ç–∞–±–ª–∏—Ü—ã

CREATE TABLE <–∏–º—è —Ç–∞–±–ª–∏—Ü—ã> (<—Å–ø–∏—Å–æ–∫ —Å–ø–µ—Ü–∏—Ñ–∏–∫–∞—Ü–∏–π —Å—Ç–æ–ª–±—Ü–æ–≤ –∏ –æ–≥—Ä–∞–Ω–∏—á–µ–Ω–∏–π>)

In [5]:
sq1_command = """
CREATE TABLE employee

(
    staff_number INTEGER PRIMARY KEY,
    fname VARCHAR(20),
    lname VARCHAR(30) DEFAUlT 'Ivanov',
    gender CHAR(1),
    joining DATE,
    birth_date DATE

);"""

–î–ª—è –æ–±–ª–µ–≥—á–µ–Ω–∏—è –∫–∞—Ç–µ–≥–æ—Ä–Ω–æ–π —Ü–µ–ª–æ—Å—Ç–Ω–æ—Å—Ç–∏ –≤ —è–∑—ã–∫–µ SQL —Å—É—â–µ—Å—Ç–≤—É—é—Ç —Å–ø–µ—Ü–∏—Ñ–∏–∫–∞—Ü–∏–∏ **PRIMARY KEY** (–ø–µ—Ä–≤–∏—á–Ω—ã–π –∫–ª—é—á) –∏ **UNIQUE** (—É–Ω–∏–∫–∞–ª—å–Ω—ã–π –∫–ª—é—á)

+ **PRIMARY KEY** –Ω–µ –º–æ–∂–µ—Ç –±—ã—Ç—å **NULL**
+ **PRIMARY KEY** –º–æ–∂–µ—Ç –±—ã—Ç—å —Ç–æ–ª—å–∫–æ –æ–¥–∏–Ω

### 3.2. INSERT

–í—Å—Ç–∞–≤–∫–∞ –Ω–æ–≤—ã—Ö –∑–∞–ø–∏—Å–µ–π –≤ —Ç–∞–±–ª–∏—Ü—É

INSERT INTO <–∏–º—è —Ç–∞–±–ª–∏—Ü—ã>[(<–∏–º—è —Å—Ç–æ–ª–±—Ü–∞>,...)]

{VALUES (<–∑–Ω–∞—á–µ–Ω–∏–µ —Å—Ç–æ–ª–±—Ü–∞>,...)}

        | <–≤—ã—Ä–∞–∂–µ–Ω–∏–µ –∑–∞–ø—Ä–æ—Å–∞>
        
        | {DEFAULT VALUES}

–ï—Å–ª–∏ –æ—Ç—Å—É—Ç—Å—Ç–≤—É–µ—Ç —Å–ø–∏—Å–æ–∫ —Å—Ç–æ–ª–±—Ü–æ–≤, —Ç–æ —Å–ø–∏—Å–æ–∫ –≤—Å—Ç–∞–≤–ª—è–µ–º—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –¥–æ–ª–∂–µ–Ω –±—ã—Ç—å –ø–æ–ª–Ω—ã–π, —Ç–æ –µ—Å—Ç—å –æ–±–µ—Å–ø–µ—á–∏–≤–∞—Ç—å –∑–Ω–∞—á–µ–Ω–∏—è –¥–ª—è –≤—Å–µ—Ö —Å—Ç–æ–ª–±—Ü–æ–≤ —Ç–∞–±–ª–∏—Ü—ã. –ü—Ä–∏ —ç—Ç–æ–º –ø–æ—Ä—è–¥–æ–∫ –∑–Ω–∞—á–µ–Ω–∏–π –¥–æ–ª–∂–µ–Ω —Å–æ–æ—Ç–≤–µ—Ç—Å—Ç–≤–æ–≤–∞—Ç—å –ø–æ—Ä—è–¥–∫—É, –∑–∞–¥–∞–Ω–Ω–æ–º—É –æ–ø–µ—Ä–∞—Ç–æ—Ä–æ–º CREATE TABLE –¥–ª—è —Ç–∞–±–ª–∏—Ü—ã, –≤ –∫–æ—Ç–æ—Ä—É—é –≤—Å—Ç–∞–≤–ª—è—é—Ç—Å—è —Å—Ç—Ä–æ–∫–∏.

In [6]:
sql_command = """INSERT INTO employee (staff_number, fname, lname, gender, birth_date)
                 VALUES (1324, "William", "Shakespeare", "m", "1961-10‚Äî25");"""

In [7]:
sql_command = """INSERT INTO employee
                 VALUES (1324, "William", "Shakespeare", "m", "1961-10‚Äî25", NULL);"""

In [8]:
sql_command = """INSERT INTO employee
                 VALUES (1324, "William", DEFAULT, "m", "1961-10‚Äî25", NULL);"""

### 3.3. UPDATE

–ò–∑–º–µ–Ω—è–µ—Ç –∏–º–µ—é—â–∏–µ—Å—è –¥–∞–Ω–Ω—ã–µ –≤ —Ç–∞–±–ª–∏—Ü–µ.

UPDATE <–∏–º—è —Ç–∞–±–ª–∏—Ü—ã>

SET {<–∏–º—è —Å—Ç–æ–ª–±—Ü–∞> = {<–≤—ã—Ä–∞–∂–µ–Ω–∏–µ –¥–ª—è –≤—ã—á–∏—Å–ª–µ–Ω–∏—è –∑–Ω–∞—á–µ–Ω–∏—è —Å—Ç–æ–ª–±—Ü–∞>

        | NULL
        
        | DEFAULT},...}
        
        [{WHERE <–ø—Ä–µ–¥–∏–∫–∞—Ç>}]

In [9]:
sql_conmand = """UPDATE employee SET fname = 'Ivan' WHERE gender = 'm' """

### 3.4. DELETE

–£–¥–∞–ª—è–µ—Ç —Å—Ç—Ä–æ–∫–∏

DELETE FROM <–∏–º—è —Ç–∞–±–ª–∏—Ü—ã>

[WHERE <–ø—Ä–µ–¥–∏–∫–∞—Ç>]

In [10]:
sql_conmand = """DELETE FROM employee WHERE lname = 'Petrov' """

### 3.5. DROP TABLE

–£–¥–∞–ª–µ–Ω–∏–µ —Ç–∞–±–ª–∏—Ü

In [11]:
sql_command = """DROP TABLE Laptop"""

<div style='height:20px; border-top: 3px, solid, red; border-left: 3px, solid, red'></div>

## –ë–∞–∑–∞ –¥–∞–Ω–Ω—ã—Ö computers

–†–µ—Å—É—Ä—Å: http://www.sql-tutorial.ru/

![](img/computers.gif)

–°–∫–∞—á–∞—Ç—å —Å–∫—Ä–∏–ø—Ç—ã: https://www.sql-ex.ru/db_script_download.php?Lang=0

In [12]:
connection = sqlite3.connect('Data/computers.db')
cursor = connection.cursor()

#DROP TABLE Laptop;
sql_command = """
DROP TABLE Laptop
"""
cursor.execute(sql_command)

sql_command = """
DROP TABLE PC
"""
cursor.execute(sql_command)

sql_command = """
DROP TABLE Product
"""
cursor.execute(sql_command)

sql_command = """
DROP TABLE Printer 
"""
cursor.execute(sql_command)

sql_command = """
CREATE TABLE IF NOT EXISTS Laptop (
	code int NOT NULL PRIMARY KEY,
	model varchar (50) NOT NULL REFERENCES Product (model),
	speed smallint NOT NULL ,
	ram smallint NOT NULL ,
	hd real NOT NULL ,
	price decimal(12,2) NULL ,
	screen tinyint NOT NULL 
);
"""
cursor.execute(sql_command)

sql_command = """
CREATE TABLE IF NOT EXISTS PC (
	code int NOT NULL PRIMARY KEY,
	model varchar (50) NOT NULL REFERENCES Product (model),
	speed smallint NOT NULL ,
	ram smallint NOT NULL ,
	hd real NOT NULL ,
	cd varchar (10) NOT NULL ,
	price decimal(12,2) NULL 
); 
"""
cursor.execute(sql_command)

sql_command = """
CREATE TABLE IF NOT EXISTS Product (
	maker varchar (10) NOT NULL ,
	model varchar (50) NOT NULL PRIMARY KEY ,
	type varchar (50) NOT NULL 
); 
"""
cursor.execute(sql_command)

sql_command = """
CREATE TABLE IF NOT EXISTS Printer (
	code int NOT NULL PRIMARY KEY,
	model varchar (50) NOT NULL REFERENCES Product (model),
	color char (1) NOT NULL ,
	`type` varchar (10) NOT NULL ,
	price decimal(12,2) NULL 
); 
"""
cursor.execute(sql_command)
    
sql_command = """
insert into Product values('B','1121','PC'),
                          ('A','1232','PC'),
                          ('A','1233','PC'),
                          ('E','1260','PC'),
                          ('A','1276','Printer'),
                          ('D','1288','Printer'),
                          ('A','1298','Laptop'),
                          ('C','1321','Laptop'),
                          ('A','1401','Printer'),
                          ('A','1408','Printer'),
                          ('D','1433','Printer'),
                          ('E','1434','Printer'),
                          ('B','1750','Laptop'),
                          ('A','1752','Laptop'),
                          ('E','2113','PC'),
                          ('E','2112','PC')
;                          
"""
cursor.execute(sql_command)

sql_command = """
insert into PC values(1,'1232',500,64,5,'12x',600),
                     (2,'1121',750,128,14,'40x',850),
                     (3,'1233',500,64,5,'12x',600),
                     (4,'1121',600,128,14,'40x',850),
                     (5,'1121',600,128,8,'40x',850),
                     (6,'1233',750,128,20,'50x',950),
                     (7,'1232',500,32,10,'12x',400),
                     (8,'1232',450,64,8,'24x',350),
                     (9,'1232',450,32,10,'24x',350),
                     (10,'1260',500,32,10,'12x',350),
                     (11,'1233',900,128,40,'40x',980),
                     (12,'1233',800,128,20,'50x',970)
;  
"""
cursor.execute(sql_command)

sql_command = """
insert into Laptop values(1,'1298',350,32,4,700,11),
                         (2,'1321',500,64,8,970,12),
                         (3,'1750',750,128,12,1200,14),
                         (4,'1298',600,64,10,1050,15),
                         (5,'1752',750,128,10,1150,14),
                         (6,'1298',450,64,10,950,12)
;  
"""
cursor.execute(sql_command)

sql_command = """
insert into Printer values(1,'1276','n','Laser',400),
                          (2,'1433','y','Jet',270),
                          (3,'1434','y','Jet',290),
                          (4,'1401','n','Matrix',150),
                          (5,'1408','n','Matrix',270),
                          (6,'1288','n','Laser',400)
;  
"""
cursor.execute(sql_command)


connection.commit()
connection.close()

<div style='height:20px; border-bottom: 3px, solid, red; border-right: 3px, solid, red'></div>

### 3.6. SELECT

–û–ø–µ—Ä–∞—Ç–æ—Ä SELECT –æ—Å—É—â–µ—Å—Ç–≤–ª—è–µ—Ç –≤—ã–±–æ—Ä–∫—É –∏–∑ –±–∞–∑—ã –¥–∞–Ω–Ω—ã—Ö

In [13]:
def sql_query(SQL_QUERY, db):
    connection = sqlite3.connect(db)
    cursor = connection.cursor()
    try:
        if str.lower(SQL_QUERY)[:6] == "select":
            df = pd.read_sql_query(SQL_QUERY, connection)
            return df
        elif str.lower(SQL_QUERY)[:4] == "with":
            df = pd.read_sql_query(SQL_QUERY, connection)
            return df

        sql_command = SQL_QUERY
        cursor.execute(sql_command)
    finally:
        connection.commit()
        connection.close()

In [14]:
sql_query("""SELECT * FROM product""", 'Data/computers.db')

   maker model     type
0      B  1121       PC
1      A  1232       PC
2      A  1233       PC
3      E  1260       PC
4      A  1276  Printer
5      D  1288  Printer
6      A  1298   Laptop
7      C  1321   Laptop
8      A  1401  Printer
9      A  1408  Printer
10     D  1433  Printer
11     E  1434  Printer
12     B  1750   Laptop
13     A  1752   Laptop
14     E  2113       PC
15     E  2112       PC

In [15]:
sql_query("""SELECT model, code FROM pc""", 'Data/computers.db')

   model  code
0   1232     1
1   1121     2
2   1233     3
3   1121     4
4   1121     5
5   1233     6
6   1232     7
7   1232     8
8   1232     9
9   1260    10
10  1233    11
11  1233    12

–£–ø—Ä–∞–∂–Ω–µ–Ω–∏–µ –¥–æ–±–∞–≤–∏—Ç—å –Ω–æ–≤—ã–µ —Å—Ç—Ä–æ–∫–∏

In [16]:
connection = sqlite3.connect('Data/computers.db')
cursor = connection.cursor()

data = [('Z','4003','Printer'), ('Z','4001','PC'), ('Z','4002','Laptop')]

cursor.executemany("INSERT INTO product VALUES(?, ?, ?)", data)

connection.commit()
connection.close()

In [17]:
sql_query("""SELECT * FROM product""", 'Data/computers.db')

   maker model     type
0      B  1121       PC
1      A  1232       PC
2      A  1233       PC
3      E  1260       PC
4      A  1276  Printer
5      D  1288  Printer
6      A  1298   Laptop
7      C  1321   Laptop
8      A  1401  Printer
9      A  1408  Printer
10     D  1433  Printer
11     E  1434  Printer
12     B  1750   Laptop
13     A  1752   Laptop
14     E  2113       PC
15     E  2112       PC
16     Z  4003  Printer
17     Z  4001       PC
18     Z  4002   Laptop

## 4. –ö–ª—é—á–µ–≤—ã–µ —Å–ª–æ–≤–∞

### 4.1. DISTINCT

–í—ã–±–∏—Ä–∞–µ—Ç —Ç–æ–ª—å–∫–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã–µ –∑–Ω–∞—á–µ–Ω–∏—è –ø–æ —Å—Ç–æ–ª–±—Ü—É –≤ –∑–∞–¥–∞–Ω–Ω–æ–π –≤—ã–±–æ—Ä–∫–µ

In [18]:
sql_query("""SELECT distinct model FROM pc""", 'Data/computers.db')

  model
0  1232
1  1121
2  1233
3  1260

### 4.2. ORDER BY

–°–æ—Ä—Ç–∏—Ä–æ–≤–∫–∞ –∑–∞–ø—Ä–æ—Å–æ–≤ –ø–æ –ø–æ–ª—é

In [19]:
sql_query("""SELECT distinct model FROM pc ORDER BY 1""", 'Data/computers.db')

  model
0  1121
1  1232
2  1233
3  1260

–°–æ—Ä—Ç–∏—Ä–æ–≤–∫–∞ –ø–æ —É–±—ã–≤–∞–Ω–∏—é **DESC**

In [20]:
sql_query("""SELECT distinct model FROM pc ORDER BY model DESC""", 'Data/computers.db')

  model
0  1260
1  1233
2  1232
3  1121

### 4.3. WHERE

–ó–∞–¥–∞–µ—Ç —É—Å–ª–æ–≤–∏–µ –Ω–∞ –≥–æ—Ä–∏–∑–æ–Ω—Ç–∞–ª—å–Ω—É—é –≤—ã–±–æ—Ä–∫—É

In [21]:
sql_query("""SELECT * FROM pc WHERE model = 1260""", 'Data/computers.db')

   code model  speed  ram    hd   cd  price
0    10  1260    500   32  10.0  12x    350

–ü—Ä–µ–¥–∏–∫–∞—Ç—ã –∫–∞–∫ –º–æ–∂–Ω–æ –µ—â–µ –∑–∞–¥–∞–≤–∞—Ç—å —É—Å–ª–æ–≤–∏—è:

![](img/–ø—Ä–µ–¥–∏–∫–∞—Ç—ã.png)

### 4.4. AS

–ü–µ—Ä–µ–∏–º–µ–Ω–æ–≤–∞–Ω–∏–µ —Å—Ç–æ–ª–±—Ü–æ–≤ –Ω–∞ —Ö–æ–¥—É

In [22]:
sql_query("""SELECT ram AS Mb, hd Gb FROM pc WHERE cd = '24x'""", 'Data/computers.db')

   Mb    Gb
0  64   8.0
1  32  10.0

## 5. –ü—Ä–µ–¥–∏–∫–∞—Ç—ã SQL

### 5.1. AND, OR, NOT

In [23]:
# –º–æ–¥–µ–ª–∏ –Ω–µ —è–≤–ª—è—é—â–∏–µ—Å—è –ø–∫ –∏ –ø—Ä–∏–Ω—Ç–µ—Ä–∞–º–∏
sql_query("""SELECT * FROM product WHERE NOT (type = 'PC' OR type = 'Printer')""", 'Data/computers.db')

  maker model    type
0     A  1298  Laptop
1     C  1321  Laptop
2     B  1750  Laptop
3     A  1752  Laptop
4     Z  4002  Laptop

### 5.2. EXISTS / NOT EXISTS

–ü—Ä–µ–¥–∏–∫–∞—Ç EXISTS –ø—Ä–∏–Ω–∏–º–∞–µ—Ç –∑–Ω–∞—á–µ–Ω–∏–µ TRUE, –µ—Å–ª–∏ –ø–æ–¥–∑–∞–ø—Ä–æ—Å —Å–æ–¥–µ—Ä–∂–∏—Ç –ª—é–±–æ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —Å—Ç—Ä–æ–∫, –∏–Ω–∞—á–µ –µ–≥–æ –∑–Ω–∞—á–µ–Ω–∏–Ω —Ä–∞–≤–Ω–æ FALSE

In [24]:
# –ù–∞–π—Ç–∏ —Ç–µ—Ö –ø—Ä–æ–∏–∑–≤–æ–¥–∏—Ç–µ–ª–µ–π –ø–æ—Ä—Ç–∞—Ç–∏–≤–Ω—ã—Ö –∫–æ–º–ø—å—é—Ç–µ—Ä–æ–≤, –∫–æ—Ç–æ—Ä—ã–µ —Ç–∞–∫–∂–µ –ø—Ä–æ–∏–∑–≤–¥—è—Ç –ø—Ä–∏–Ω—Ç–µ—Ä—ã
sql_query("""SELECT DISTINCT maker 
             FROM product AS lap_product
             WHERE type = 'Laptop' AND
                         EXISTS (
                         SELECT maker FROM product
                         WHERE type = 'Printer' AND
                         maker = lap_product.maker
                         );
""", 'Data/computers.db')

  maker
0     A
1     Z

### 5.3. BETWEEN

In [25]:
sql_query("""SELECT model, speed FROM PC WHERE price BETWEEN 400 AND 600""", 'Data/computers.db')

  model  speed
0  1232    500
1  1233    500
2  1232    500

### 5.4. IN

In [26]:
sql_query("""SELECT model, speed, hd FROM PC WHERE hd IN (10, 20)""", 'Data/computers.db')

  model  speed    hd
0  1233    750  20.0
1  1232    500  10.0
2  1232    450  10.0
3  1260    500  10.0
4  1233    800  20.0

–£–ø—Ä–∞–∂–Ω–µ–Ω–∏–µ

In [27]:
# –ù–∞–π—Ç–∏ –Ω–æ–º–µ—Ä –º–æ–¥–µ–ª–∏, –æ–±—ä–µ–º –ø–∞–º—è—Ç–∏ –∏ —Ä–∞–∑–º–µ—Ä—ã —ç–∫—Ä–∞–Ω–æ–≤ –ü–ö-–±–ª–æ–∫–Ω–æ—Ç–æ–≤, —Ü–µ–Ω–∞ –∫–æ—Ç–æ—Ä—ã—Ö –ø—Ä–µ–≤—ã—à–∞–µ—Ç 1000$
sql_query("""SELECT model, ram, screen FROM Laptop WHERE price > 1000""", 'Data/computers.db')

  model  ram  screen
0  1750  128      14
1  1298   64      15
2  1752  128      14

In [28]:
# –ù–∞–π—Ç–∏ –Ω–æ–º–µ—Ä –º–æ–¥–µ–ª–∏, —Å–∫–æ—Ä–æ—Å—Ç—å –∏ —Ä–∞–∑–º–µ—Ä –∂–µ—Å—Ç–æ–∫–æ–≥–æ –¥–∏—Å–∫–∞ –ü–ö, –∏–º–µ—é—â–∏—Ö 12—Ö –∏–ª–∏ 24—Ö CD –∏ —Ü–µ–Ω—É –º–µ–Ω–µ–µ 600$
sql_query("""SELECT model, speed, hd FROM PC WHERE cd = '12x' OR cd = '24x' AND price < 600""", 'Data/computers.db')

  model  speed    hd
0  1232    500   5.0
1  1233    500   5.0
2  1232    500  10.0
3  1232    450   8.0
4  1232    450  10.0
5  1260    500  10.0

### 5.5. LIKE

–ú–∞—Å–∫–∞

–°–∏–º–≤–æ–ª " _ " -  –≤–º–µ—Å—Ç–æ –ª—é–±–æ–≥–æ –µ–¥–∏–Ω–∏—á–Ω–æ–≥–æ —Å–∏–º–≤–æ–ª–∞ –≤ –ø—Ä–æ–≤–µ—Ä—è–µ–º–æ–º –∑–Ω–∞—á–µ–Ω–∏–∏.

–°–∏–º–≤–æ–ª " % " - –∑–∞–º–µ–Ω—è–µ–∏ –ø–æ—Å–ª–µ–¥–æ–≤–∞—Ç–µ–ª—å–Ω–æ—Å—Ç—å –ª—é–±—ã—Ö —Å–∏–º–≤–æ–ª–æ–≤ (—á–∏—Å–ª–æ —Å–∏–º–≤–æ–ª–æ–≤ –æ—Ç 0 –∏ –±–æ–ª–µ–µ) –≤ –ø—Ä–æ–≤–µ—Ä—è–µ–º–æ–º –∑–Ω–∞—á–µ–Ω–∏–∏.

![](img/like.png)

In [29]:
sql_query("""SELECT * FROM product WHERE type LIKE 'P%' """, 'Data/computers.db')

   maker model     type
0      B  1121       PC
1      A  1232       PC
2      A  1233       PC
3      E  1260       PC
4      A  1276  Printer
5      D  1288  Printer
6      A  1401  Printer
7      A  1408  Printer
8      D  1433  Printer
9      E  1434  Printer
10     E  2113       PC
11     E  2112       PC
12     Z  4003  Printer
13     Z  4001       PC

In [30]:
sql_query("""SELECT * FROM product WHERE type LIKE 'P%' AND type NOT LIKE 'PC%' """, 'Data/computers.db')

  maker model     type
0     A  1276  Printer
1     D  1288  Printer
2     A  1401  Printer
3     A  1408  Printer
4     D  1433  Printer
5     E  1434  Printer
6     Z  4003  Printer

In [31]:
sql_query("""SELECT * FROM product WHERE model LIKE '12%' """, 'Data/computers.db')

  maker model     type
0     A  1232       PC
1     A  1233       PC
2     E  1260       PC
3     A  1276  Printer
4     D  1288  Printer
5     A  1298   Laptop

In [32]:
sql_query("""SELECT * FROM Printer WHERE model LIKE '1%1' """, 'Data/computers.db')

   code model color    type  price
0     4  1401     n  Matrix    150

## 6. –ê–≥—Ä–µ–≥–∞—Ç—ã

### 6.1. SUM, MIN, MAX, AVG, COUNT

In [33]:
sql_query("""SELECT MIN(price) AS min_price, MAX(price) AS max_price, COUNT(price) AS count_price FROM PC """, 'Data/computers.db')

   min_price  max_price  count_price
0        350        980           12

In [34]:
sql_query("""SELECT COUNT(maker) AS count_A FROM product WHERE maker = 'A' and (type IN ('PC', 'Laptop')) """, 'Data/computers.db')

   count_A
0        4

In [35]:
sql_query("""SELECT COUNT(model) AS count_model FROM product WHERE maker = 'A' and type = 'PC' """, 'Data/computers.db')

   count_model
0            2

### 6.2. GROUP BY / HAVING

![](img/groupby.png)

**GROUP BY** –∏—Å–ø–æ–ª—å–∑—É–µ—Ç—Å—è –¥–ª—è –æ–±—ä–µ–¥–∏–Ω–µ–Ω–∏—è —Ä–µ–∑—É–ª—å—Ç–∞—Ç–æ–≤ –≤—ã–±–æ—Ä–∫–∏ –ø–æ –æ–¥–Ω–æ–º—É –∏–ª–∏ –Ω–µ—Å–∫–æ–ª—å–∫–∏–º —Å—Ç–æ–ª–±—Ü–∞–º

In [36]:
sql_query("""SELECT model, COUNT(model) AS Qty_model,
            AVG(price) AS Avg_price
            FROM PC
            GROUP BY model""",
'Data/computers.db')

  model  Qty_model  Avg_price
0  1121          3      850.0
1  1232          4      425.0
2  1233          4      875.0
3  1260          1      350.0

–ï—Å–ª–∏ **WHERE** –æ–ø—Ä–µ–¥–µ–ª—è–µ—Ç –ø—Ä–µ–¥–∏–∫–∞—Ç –¥–ª—è —Ñ–∏–ª—å—Ç—Ä–∞—Ü–∏–∏ —Å—Ç—Ä–æ–∫, —Ç–æ **HAVING** –ø—Ä–∏–º–µ–Ω—è–µ—Ç—Å—è –ø–æ—Å–ª–µ –≥—Ä—É–ø–ø–∏—Ä–æ–≤–∫–∏ –¥–ª—è –æ–ø—Ä–µ–¥–µ–ª–µ–Ω–∏—è –∞–Ω–∞–ª–æ–Ω—á–Ω–æ–≥–æ –ø—Ä–µ–¥–∏–∫–∞—Ç–∞, —Ñ–∏–ª—å—Ç—Ä—É—é—â–µ–≥–æ –≥—Ä—É–ø–ø—ã –ø–æ –∑–Ω–∞—á–µ–Ω–∏—è–º –∞–≥—Ä–µ–≥–∞—Ç–Ω—ã—Ö —Ñ—É–Ω–∫—Ü–∏–π.

In [37]:
sql_query("""SELECT model, COUNT(model) AS Qty_model,
            AVG(price) AS Avg_price
            FROM PC
            GROUP BY model
            HAVING AVG(price) > 500""",
'Data/computers.db')

  model  Qty_model  Avg_price
0  1121          3      850.0
1  1233          4      875.0

–ü—Ä–∞–≤–∏–ª—å–Ω—ã–π –ø–æ—Ä—è–¥–æ–∫

**SELECT** <–≤—ã—Ä–∞–∂–µ–Ω–∏–µ>

**FROM** <–∏–º—è —Ç–∞–±–ª–∏—Ü—ã>

[**WHERE** <–ø—Ä–µ–¥–∏–∫–∞—Ç>]

[[**GROUP BY** <—Å–ø–∏—Å–æ–∫ —Å—Ç–æ–ª–±—Ü–æ–≤>]

[**HAVING** <—É—Å–ª–æ–≤–∏–µ –Ω–∞ –∞–≥—Ä–µ–≥–∞—Ç–Ω–æ–µ –∑–Ω–∞—á–µ–Ω–∏–µ>]]

[**ORDER BY** <—Å–ø–∏—Å–æ–∫ —Å—Ç–æ–ª–±—Ü–æ–≤>]

In [38]:
# –ù–∞–π—Ç–∏ –ø—Ä–æ–∏–∑–≤–æ–¥–∏—Ç–µ–ª–µ–π ,–≤—ã–ø—É—Å–∫–∞—é—â–∏—Ö –ø–æ –º–µ–Ω—å—à–µ–π –º–µ—Ä–µ 3 —Ä–∞–∑–ª–∏—á–Ω—ã—Ö –º–æ–¥–µ–ª–∏ –ü–ö.
# –í—ã–≤–µ—Å—Ç–∏ Maker, —á–∏—Å–ª–æ –º–æ–¥–µ–ª–µ–π –ü–ö
sql_query("""SELECT maker, COUNT(model)
            FROM product
            WHERE type = 'PC'
            GROUP BY maker
            HAVING COUNT(model) >= 3
""",
'Data/computers.db')

  maker  COUNT(model)
0     E             3

In [39]:
# –ù–∞–π—Ç–∏ —Å—Ä–µ–¥–Ω–∏–π —Ä–∞–∑–º–µ—Ä –¥–∏—Å–∫–∞ –ü–ö (–æ–¥–Ω–æ –∑–Ω–∞—á–µ–Ω–∏–µ –¥–ª—è –≤—Å–µ—Ö) —Ç–µ—Ö –ø—Ä–æ–∏–∑–≤–æ–¥–∏—Ç–µ–ª–µ–π, –∫–æ—Ç–æ—Ä—ã–µ –≤—ã–ø—É—Å–∫–∞—é—Ç –∏ –ø—Ä–∏–Ω—Ç–µ—Ä—ã.
# –í—ã–≤–µ—Å—Ç–∏ —Å—Ä–µ–¥–Ω–∏–π —Ä–∞–∑–º–µ—Ä HD
sql_query("""SELECT maker, AVG(hd)
             FROM product AS PC_product, PC
             WHERE type = 'PC' AND
                         EXISTS (
                         SELECT maker FROM product
                         WHERE type = 'Printer' AND
                         maker = PC_product.maker
                         ) 
             GROUP BY maker


""",
'Data/computers.db')

  maker    AVG(hd)
0     A  13.666667
1     E  13.666667
2     Z  13.666667

## 7. –í—ã–±–æ—Ä –∏–∑ –Ω–µ—Å–∫–æ–ª—å–∫–∏—Ö –∏—Å—Ç–æ—á–Ω–∏–∫–æ–≤

In [41]:
sql_query("""SELECT * FROM product 
            WHERE type = 'Printer'""",
'Data/computers.db')

  maker model     type
0     A  1276  Printer
1     D  1288  Printer
2     A  1401  Printer
3     A  1408  Printer
4     D  1433  Printer
5     E  1434  Printer
6     Z  4003  Printer

In [42]:
# –î–µ–∫–∞—Ä—Ç–æ–≤–æ –ø—Ä–æ–∏–∑–≤–µ–¥–µ–Ω–∏–µ
sql_query("""SELECT * 
             FROM product, (SELECT  DISTINCT type as type_of_printer FROM printer)
             WHERE type = 'Printer'""",
'Data/computers.db')

   maker model     type type_of_printer
0      A  1276  Printer           Laser
1      A  1401  Printer           Laser
2      A  1408  Printer           Laser
3      D  1288  Printer           Laser
4      D  1433  Printer           Laser
5      E  1434  Printer           Laser
6      Z  4003  Printer           Laser
7      A  1276  Printer             Jet
8      A  1401  Printer             Jet
9      A  1408  Printer             Jet
10     D  1288  Printer             Jet
11     D  1433  Printer             Jet
12     E  1434  Printer             Jet
13     Z  4003  Printer             Jet
14     A  1276  Printer          Matrix
15     A  1401  Printer          Matrix
16     A  1408  Printer          Matrix
17     D  1288  Printer          Matrix
18     D  1433  Printer          Matrix
19     E  1434  Printer          Matrix
20     Z  4003  Printer          Matrix

### 7.1. JOIN

![](img/join.png)

–ù–∞–π—Ç–∏ –ø—Ä–æ–∏–∑–≤–æ–¥–∏—Ç–µ–ª—è, –Ω–æ–º–µ—Ä –º–æ–¥–µ–ª–∏ –∏ —Ü–µ–Ω—É –∫–∞–∂–¥–æ–≥–æ –∫–æ–º–ø—å—é—Ç–µ—Ä–∞, –∏–º–µ—é—â–µ–≥–æ—Å—è –≤ –ë–î

**INNER JOIN**

In [43]:
sql_query("""SELECT maker, Product.model AS model_1,
             PC.model AS model_2, price
             FROM product INNER JOIN
             PC ON PC.model = Product.model
             ORDER BY maker, model_2""",
'Data/computers.db')

   maker model_1 model_2  price
0      A    1232    1232    600
1      A    1232    1232    400
2      A    1232    1232    350
3      A    1232    1232    350
4      A    1233    1233    600
5      A    1233    1233    950
6      A    1233    1233    980
7      A    1233    1233    970
8      B    1121    1121    850
9      B    1121    1121    850
10     B    1121    1121    850
11     E    1260    1260    350

**LEFT JOIN**

In [44]:
sql_query("""SELECT maker, Product.model AS model_1,
             PC.model AS model_2, price
             FROM product LEFT JOIN
             PC ON PC.model = Product.model
             ORDER BY maker, model_2""",
'Data/computers.db')

   maker model_1 model_2  price
0      A    1276    None    NaN
1      A    1298    None    NaN
2      A    1401    None    NaN
3      A    1408    None    NaN
4      A    1752    None    NaN
5      A    1232    1232  350.0
6      A    1232    1232  350.0
7      A    1232    1232  400.0
8      A    1232    1232  600.0
9      A    1233    1233  600.0
10     A    1233    1233  950.0
11     A    1233    1233  970.0
12     A    1233    1233  980.0
13     B    1750    None    NaN
14     B    1121    1121  850.0
15     B    1121    1121  850.0
16     B    1121    1121  850.0
17     C    1321    None    NaN
18     D    1288    None    NaN
19     D    1433    None    NaN
20     E    1434    None    NaN
21     E    2113    None    NaN
22     E    2112    None    NaN
23     E    1260    1260  350.0
24     Z    4003    None    NaN
25     Z    4001    None    NaN
26     Z    4002    None    NaN

–£–ø—Ä–∞–∂–Ω–µ–Ω–∏–µ

–ù–∞–π—Ç–∏ –ø—Ä–æ–∏–∑–≤–æ–¥–∏—Ç–µ–ª–µ–π, –∫–æ—Ç–æ—Ä—ã–µ –ø—Ä–æ–∏–∑–≤–æ–¥–∏–ª–∏ –±—ã –ü–ö —Å–æ —Å–∫–æ—Ä–æ—Å—Ç—å—é  –Ω–µ –º–µ–Ω–µ–µ 750 –ú–ì—Ü, —Ç–∞–∫ –∏ –ü–ö –±–ª–æ–∫–Ω–æ—Ç—ã —Å–æ —Å–∫–æ—Ä–æ—Å—Ç—å—é –Ω–µ –º–µ–Ω–µ–µ 750 –ú–ì—Ü

In [45]:
sql_query("""SELECT maker
FROM product join pc on pc.model=product.model
WHERE speed >=750
INTERSECT
SELECT maker
FROM product join laptop on laptop.model=product.model
WHERE speed >=750
             
             
             
            """,
'Data/computers.db')

  maker
0     A
1     B

### 7.2. UNION

–ü—Ä–µ–¥–ª–æ–∂–µ–Ω–∏–µ **UNION** –ø—Ä–∏–≤–æ–¥–∏—Ç –∫ –ø–æ—è–≤–ª–µ–Ω–∏—é –≤ —Ä–µ–∑—É–ª—å—Ç–∏—Ä—É—é—â–µ–º –Ω–∞–±–æ—Ä–µ –≤—Å–µ—Ö —Å—Ç—Ä–æ–∫ –∫–∞–∂–¥–æ–≥–æ –∏–∑ –∑–∞–ø—Ä–æ—Å–æ–≤. –ü—Ä–∏ —ç—Ç–æ–º, –µ—Å–ª–∏ –æ–ø—Ä–µ–¥–µ–ª–µ–Ω –ø–∞—Ä–∞–º–µ—Ç—Ä **ALL**, —Ç–æ —Å–æ—Ö—Ä–∞–Ω—è—é—Ç—Å—è –≤—Å–µ –¥—É–±–ª–∏–∫–∞—Ç—ã –≤—ã—Ö–æ–¥–Ω—ã—Ö —Å—Ç—Ä–æ–∫, –≤ –ø—Ä–æ—Ç–∏–≤–Ω–æ–º —Å–ª—É—á–∞–µ –≤ —Ä–µ–∑—É–ª—å—Ç–∏—Ä—É—é—â–µ–º –Ω–∞–±–æ—Ä–µ –ø—Ä–∏—Å—É—Ç—Å—Ç–≤—É—é—Ç —Ç–æ–ª—å–∫–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã–µ —Å—Ç—Ä–æ–∫–∏.

–û–ø–µ—Ä–∞—Ü–∏—è –æ–±—ä–µ–¥–∏–Ω–µ–Ω–∏—è –º–æ–∂–µ—Ç –±—ã—Ç—å –≤—ã–ø–æ–ª–Ω–µ–Ω–∞ —Ç–æ–ª—å–∫–æ –ø—Ä–∏ –≤—ã–ø–æ–ª–Ω–µ–Ω–∏–∏ —Å–ª–µ–¥—É—é—â–∏—Ö —É—Å–ª–æ–≤–∏–π:

+ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –≤—ã—Ö–æ–¥–Ω—ã—Ö —Å—Ç–æ–ª–±—Ü–æ–≤ –∫–∞–∂–¥–æ–≥–æ –∏–∑ –∑–∞–ø—Ä–æ—Å–æ–≤ –¥–æ–ª–∂–Ω–æ –±—ã—Ç—å –æ–¥–∏–Ω–∞–∫–æ–≤—ã–º;
+ –≤—ã—Ö–æ–¥–Ω—ã–µ —Å—Ç–æ–ª–±—Ü—ã –∫–∞–∂–¥–æ–≥–æ –∏–∑ –∑–∞–ø—Ä–æ—Å–æ–≤ –¥–æ–ª–∂–Ω—ã –±—ã—Ç—å —Å–æ–≤–º–µ—Å—Ç–∏–º—ã –º–µ–∂–¥—É —Å–æ–±–æ–π (–≤ –ø–æ—Ä—è–¥–∫–µ –∏—Ö —Å–ª–µ–¥–æ–≤–∞–Ω–∏—è) –ø–æ —Ç–∏–ø–∞–º –¥–∞–Ω–Ω—ã—Ö;
+ –≤ —Ä–µ–∑—É–ª—å—Ç–∏—Ä—É—é—â–µ–º –Ω–∞–±–æ—Ä–µ –∏—Å–ø–æ–ª—å–∑—É—é—Ç—Å—è –∏–º–µ–Ω–∞ —Å—Ç–æ–ª–±—Ü–æ–≤, –∑–∞–¥–∞–Ω–Ω—ã–µ –≤ –ø–µ—Ä–≤–æ–º –∑–∞–ø—Ä–æ—Å–µ;

–ù–∞–π—Ç–∏ –Ω–æ–º–µ—Ä–∞ –º–æ–¥–µ–ª–µ–π –∏ —Ü–µ–Ω—ã –ü–ö –∏ –ø–æ—Ä—Ç–∞—Ç–∏–≤–Ω—ã—Ö –∫–æ–º–ø—å—é—Ç–µ—Ä–æ–≤:

In [46]:
sql_query("""SELECT model, price
             FROM PC
             UNION
             SELECT model, price
             FROM Laptop         
""",
'Data/computers.db')

   model  price
0   1121    850
1   1232    350
2   1232    400
3   1232    600
4   1233    600
5   1233    950
6   1233    970
7   1233    980
8   1260    350
9   1298    700
10  1298    950
11  1298   1050
12  1321    970
13  1750   1200
14  1752   1150

#### –†–∞–∑–Ω–∏—Ü–∞ **UNION ALL** –∏ **UNION**

In [47]:
sql_query("""SELECT p.model, p.type 
             FROM PC
             JOIN Product p ON PC.model = p.model WHERE maker = 'B'
             UNION ALL
             SELECT p.model, p.type 
             FROM printer
             JOIN Product p ON printer.model = p.model WHERE maker = 'B'
             UNION ALL
             SELECT p.model, p.type 
             FROM laptop
             JOIN Product p ON laptop.model = p.model WHERE maker = 'B'     
""",
'Data/computers.db')

  model    type
0  1121      PC
1  1121      PC
2  1121      PC
3  1750  Laptop

In [48]:
sql_query("""SELECT p.model, p.type 
             FROM PC
             JOIN Product p ON PC.model = p.model WHERE maker = 'B'
             UNION
             SELECT p.model, p.type 
             FROM printer
             JOIN Product p ON printer.model = p.model WHERE maker = 'B'
             UNION
             SELECT p.model, p.type 
             FROM laptop
             JOIN Product p ON laptop.model = p.model WHERE maker = 'B'     
""",
'Data/computers.db')

  model    type
0  1121      PC
1  1750  Laptop

–£–ø—Ä–∞–∂–Ω–µ–Ω–∏–µ

–ù–∞–π–¥–∏—Ç–µ –ø—Ä–æ–∏–∑–≤–æ–¥–∏—Ç–µ–ª–µ–π –ø—Ä–∏–Ω—Ç–µ—Ä–æ–≤, –∫–æ—Ç–æ—Ä—ã–µ –ø—Ä–æ–∏–∑–≤–æ–¥—è—Ç –ü–ö —Å –Ω–∞–∏–º–µ–Ω—å—à–∏–º –æ–±—ä–µ–º–æ–º RAM –∏ —Å–∞–º—ã–º –±—ã—Å—Ç—Ä—ã–º –ø—Ä–æ—Ü–µ—Å—Å–æ—Ä–æ–º —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö –ü–ö, –∏–º–µ—é—â–∏—Ö –Ω–∞–∏–º–µ–Ω—å—à–∏–π –æ–±—ä–µ–º RAM. –í—ã–≤–µ—Å—Ç–∏ Maker

In [49]:
sql_query("""SELECT DISTINCT maker
             FROM product
             WHERE model IN (
             SELECT model
             FROM pc
             WHERE ram = (
                 SELECT MIN(ram)
                 FROM pc
             )
             AND speed = (
                 SELECT MAX(speed)
                 FROM pc
                 WHERE ram = (
                     SELECT MIN(ram)
                     FROM pc
                     )
                 )
             )
             AND
             maker IN (
             SELECT maker
             FROM product
             WHERE type='Printer'
             )
""",
'Data/computers.db')

  maker
0     A
1     E

In [50]:
sql_query("""WITH union_price AS (
    SELECT  model, price 
    FROM PC
    WHERE price = (SELECT MAX(price) 
                   FROM PC
                  )
    UNION
    SELECT  model,  price 
    FROM Laptop
    WHERE price = (SELECT MAX(price) 
                   FROM Laptop
                  )
    UNION
    SELECT  model,  price 
    FROM Printer
    WHERE price = (SELECT MAX(price) 
                   FROM Printer
                  )
)
SELECT  model
FROM union_price 
WHERE price = (SELECT MAX(price)
FROM union_price
)

""",
'Data/computers.db')

  model
0  1750